VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031_gpio.h
/*******************************************************************************
 *
 * 代码许可和免责信息
 * 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
 * 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
 * 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
 * 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
 * 或条件。
 * 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
 * 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
 * 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
 * 损失。
 * 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
 * 全部上述排除或限制可能并不适用于您。
 *
 *******************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32W031_GPIO_H__
#define __CW32W031_GPIO_H__

#ifdef __cplusplus
extern "C"
{
#endif

    /*****************************************************************************/
    /* Include files                                                             */
    /*****************************************************************************/

#include "base_types.h"
#include "cw32w031.h"

    /*****************************************************************************/
    /* Global pre-processor symbols/macros ('#define')                           */
    /*****************************************************************************/

    typedef struct
    {
        uint32_t Pins;
        uint32_t Mode;
        uint32_t IT;
    } GPIO_InitTypeDef;

    typedef enum
    {
        GPIO_Pin_RESET = 0,
        GPIO_Pin_SET
    } GPIO_PinState;

    //============================================================

    void GPIO_SWD2GPIO(void);
    void GPIO_GPIO2SWD(void);
    void GPIO_LockPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
    void GPIO_DeInit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pins);
    void GPIO_Init(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef *GPIO_Init);
    void GPIO_ConfigFilter(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, uint32_t FltClk);
    void GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, GPIO_PinState PinState);
    void GPIO_Write(GPIO_TypeDef *GPIOx, uint16_t Value);
    void GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
    GPIO_PinState GPIO_ReadPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);

    //============================================================

#define GPIO_MODE_ANALOG (0X00)
#define GPIO_MODE_INPUT (0x10)
#define GPIO_MODE_INPUT_PULLUP (0x11)
#define GPIO_MODE_INPUT_PULLDOWN (0x12)
#define GPIO_MODE_OUTPUT_PP (0x20)
#define GPIO_MODE_OUTPUT_OD (0x21)

#define GPIO_IT_NONE (0x80)
#define GPIO_IT_RISING (0x81)
#define GPIO_IT_FALLING (0x82)
#define GPIO_IT_HIGH (0x84)
#define GPIO_IT_LOW (0x88)

    //============================================================

#define GPIO_PIN_0 ((uint16_t)0x0001)   /* Pin 0    selected    */
#define GPIO_PIN_1 ((uint16_t)0x0002)   /* Pin 1    selected    */
#define GPIO_PIN_2 ((uint16_t)0x0004)   /* Pin 2    selected    */
#define GPIO_PIN_3 ((uint16_t)0x0008)   /* Pin 3    selected    */
#define GPIO_PIN_4 ((uint16_t)0x0010)   /* Pin 4    selected    */
#define GPIO_PIN_5 ((uint16_t)0x0020)   /* Pin 5    selected    */
#define GPIO_PIN_6 ((uint16_t)0x0040)   /* Pin 6    selected    */
#define GPIO_PIN_7 ((uint16_t)0x0080)   /* Pin 7    selected    */
#define GPIO_PIN_8 ((uint16_t)0x0100)   /* Pin 8    selected    */
#define GPIO_PIN_9 ((uint16_t)0x0200)   /* Pin 9    selected    */
#define GPIO_PIN_10 ((uint16_t)0x0400)  /* Pin 10   selected    */
#define GPIO_PIN_11 ((uint16_t)0x0800)  /* Pin 11   selected    */
#define GPIO_PIN_12 ((uint16_t)0x1000)  /* Pin 12   selected    */
#define GPIO_PIN_13 ((uint16_t)0x2000)  /* Pin 13   selected    */
#define GPIO_PIN_14 ((uint16_t)0x4000)  /* Pin 14   selected    */
#define GPIO_PIN_15 ((uint16_t)0x8000)  /* Pin 15   selected    */
#define GPIO_PIN_All ((uint16_t)0xFFFF) /* All pins selected    */

//============================================================
//端口滤波定义
#define GPIO_FLTCLK_HCLK2 (((uint32_t)0) << 16)
#define GPIO_FLTCLK_HCLK4 (((uint32_t)1) << 16)
#define GPIO_FLTCLK_HCLK8 (((uint32_t)2) << 16)
#define GPIO_FLTCLK_BTIM1OV (((uint32_t)3) << 16)
#define GPIO_FLTCLK_RC150K (((uint32_t)4) << 16)
#define GPIO_FLTCLK_LSI (((uint32_t)5) << 16)
#define GPIO_FLTCLK_RC10K (((uint32_t)6) << 16)
#define GPIO_FLTCLK_LPTIMPWM (((uint32_t)7) << 16)

//============================================================
//清除CW_GPIO中断标志
#define GPIOA_INTFLAG_CLR(Mask) ((CW_GPIOA->ICR) = (~((uint32_t)(Mask))))
#define GPIOB_INTFLAG_CLR(Mask) ((CW_GPIOB->ICR) = (~((uint32_t)(Mask))))
#define GPIOC_INTFLAG_CLR(Mask) ((CW_GPIOC->ICR) = (~((uint32_t)(Mask))))
#define GPIOF_INTFLAG_CLR(Mask) ((CW_GPIOF->ICR) = (~((uint32_t)(Mask))))

//============================================================
// ANALOG OR DIGTAL
#define PA00_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN0 = 0)
#define PA00_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN0 = 1)
#define PA01_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN1 = 0)
#define PA01_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN1 = 1)
#define PA02_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN2 = 0)
#define PA02_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN2 = 1)
#define PA03_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN3 = 0)
#define PA03_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN3 = 1)
#define PA04_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN4 = 0)
#define PA04_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN4 = 1)
#define PA05_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN5 = 0)
#define PA05_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN5 = 1)
#define PA06_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN6 = 0)
#define PA06_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN6 = 1)
#define PA07_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN7 = 0)
#define PA07_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN7 = 1)
#define PA08_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN8 = 0)
#define PA08_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN8 = 1)
#define PA09_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN9 = 0)
#define PA09_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN9 = 1)
#define PA10_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN10 = 0)
#define PA10_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN10 = 1)
#define PA11_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN11 = 0)
#define PA11_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN11 = 1)
#define PA12_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN12 = 0)
#define PA12_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN12 = 1)
#define PA13_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN13 = 0)
#define PA13_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN13 = 1)
#define PA14_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN14 = 0)
#define PA14_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN14 = 1)
#define PA15_DIGTAL_ENABLE() (CW_GPIOA->ANALOG_f.PIN15 = 0)
#define PA15_ANALOG_ENABLE() (CW_GPIOA->ANALOG_f.PIN15 = 1)

