VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031_gpio.h
#define PB00_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN0 = 0)
#define PB00_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN0 = 1)
#define PB01_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN1 = 0)
#define PB01_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN1 = 1)
#define PB02_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN2 = 0)
#define PB02_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN2 = 1)
#define PB03_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN3 = 0)
#define PB03_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN3 = 1)
#define PB04_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN4 = 0)
#define PB04_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN4 = 1)
#define PB05_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN5 = 0)
#define PB05_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN5 = 1)
#define PB06_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN6 = 0)
#define PB06_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN6 = 1)
#define PB07_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN7 = 0)
#define PB07_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN7 = 1)
#define PB08_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN8 = 0)
#define PB08_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN8 = 1)
#define PB09_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN9 = 0)
#define PB09_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN9 = 1)
#define PB10_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN10 = 0)
#define PB10_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN10 = 1)
#define PB11_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN11 = 0)
#define PB11_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN11 = 1)
#define PB12_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN12 = 0)
#define PB12_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN12 = 1)
#define PB13_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN13 = 0)
#define PB13_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN13 = 1)
#define PB14_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN14 = 0)
#define PB14_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN14 = 1)
#define PB15_DIGTAL_ENABLE() (CW_GPIOB->ANALOG_f.PIN15 = 0)
#define PB15_ANALOG_ENABLE() (CW_GPIOB->ANALOG_f.PIN15 = 1)

#define PC00_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN0 = 0)
#define PC00_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN0 = 1)
#define PC01_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN1 = 0)
#define PC01_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN1 = 1)
#define PC02_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN2 = 0)
#define PC02_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN2 = 1)
#define PC03_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN3 = 0)
#define PC03_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN3 = 1)
#define PC04_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN4 = 0)
#define PC04_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN4 = 1)
#define PC05_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN5 = 0)
#define PC05_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN5 = 1)
#define PC06_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN6 = 0)
#define PC06_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN6 = 1)
#define PC07_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN7 = 0)
#define PC07_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN7 = 1)
#define PC08_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN8 = 0)
#define PC08_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN8 = 1)
#define PC09_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN9 = 0)
#define PC09_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN9 = 1)
#define PC10_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN10 = 0)
#define PC10_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN10 = 1)
#define PC11_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN11 = 0)
#define PC11_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN11 = 1)
#define PC12_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN12 = 0)
#define PC12_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN12 = 1)
#define PC13_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN13 = 0)
#define PC13_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN13 = 1)
#define PC14_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN14 = 0)
#define PC14_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN14 = 1)
#define PC15_DIGTAL_ENABLE() (CW_GPIOC->ANALOG_f.PIN15 = 0)
#define PC15_ANALOG_ENABLE() (CW_GPIOC->ANALOG_f.PIN15 = 1)

#define PF00_DIGTAL_ENABLE() (CW_GPIOF->ANALOG_f.PIN0 = 0)
#define PF00_ANALOG_ENABLE() (CW_GPIOF->ANALOG_f.PIN0 = 1)
#define PF01_DIGTAL_ENABLE() (CW_GPIOF->ANALOG_f.PIN1 = 0)
#define PF01_ANALOG_ENABLE() (CW_GPIOF->ANALOG_f.PIN1 = 1)
#define PF06_DIGTAL_ENABLE() (CW_GPIOF->ANALOG_f.PIN6 = 0)
#define PF06_ANALOG_ENABLE() (CW_GPIOF->ANALOG_f.PIN6 = 1)
#define PF07_DIGTAL_ENABLE() (CW_GPIOF->ANALOG_f.PIN7 = 0)
#define PF07_ANALOG_ENABLE() (CW_GPIOF->ANALOG_f.PIN7 = 1)

//============================================================
// INPUTAND OUTPUT
#define PA00_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN0 = 0)
#define PA00_DIR_INPUT() (CW_GPIOA->DIR_f.PIN0 = 1)
#define PA01_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN1 = 0)
#define PA01_DIR_INPUT() (CW_GPIOA->DIR_f.PIN1 = 1)
#define PA02_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN2 = 0)
#define PA02_DIR_INPUT() (CW_GPIOA->DIR_f.PIN2 = 1)
#define PA03_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN3 = 0)
#define PA03_DIR_INPUT() (CW_GPIOA->DIR_f.PIN3 = 1)
#define PA04_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN4 = 0)
#define PA04_DIR_INPUT() (CW_GPIOA->DIR_f.PIN4 = 1)
#define PA05_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN5 = 0)
#define PA05_DIR_INPUT() (CW_GPIOA->DIR_f.PIN5 = 1)
#define PA06_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN6 = 0)
#define PA06_DIR_INPUT() (CW_GPIOA->DIR_f.PIN6 = 1)
#define PA07_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN7 = 0)
#define PA07_DIR_INPUT() (CW_GPIOA->DIR_f.PIN7 = 1)
#define PA08_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN8 = 0)
#define PA08_DIR_INPUT() (CW_GPIOA->DIR_f.PIN8 = 1)
#define PA09_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN9 = 0)
#define PA09_DIR_INPUT() (CW_GPIOA->DIR_f.PIN9 = 1)
#define PA10_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN10 = 0)
#define PA10_DIR_INPUT() (CW_GPIOA->DIR_f.PIN10 = 1)
#define PA11_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN11 = 0)
#define PA11_DIR_INPUT() (CW_GPIOA->DIR_f.PIN11 = 1)
#define PA12_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN12 = 0)
#define PA12_DIR_INPUT() (CW_GPIOA->DIR_f.PIN12 = 1)
#define PA13_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN13 = 0)
#define PA13_DIR_INPUT() (CW_GPIOA->DIR_f.PIN13 = 1)
#define PA14_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN14 = 0)
#define PA14_DIR_INPUT() (CW_GPIOA->DIR_f.PIN14 = 1)
#define PA15_DIR_OUTPUT() (CW_GPIOA->DIR_f.PIN15 = 0)
#define PA15_DIR_INPUT() (CW_GPIOA->DIR_f.PIN15 = 1)

#define PB00_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN0 = 0)
#define PB00_DIR_INPUT() (CW_GPIOB->DIR_f.PIN0 = 1)
#define PB01_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN1 = 0)
#define PB01_DIR_INPUT() (CW_GPIOB->DIR_f.PIN1 = 1)
#define PB02_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN2 = 0)
#define PB02_DIR_INPUT() (CW_GPIOB->DIR_f.PIN2 = 1)
#define PB03_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN3 = 0)
#define PB03_DIR_INPUT() (CW_GPIOB->DIR_f.PIN3 = 1)
#define PB04_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN4 = 0)
#define PB04_DIR_INPUT() (CW_GPIOB->DIR_f.PIN4 = 1)
#define PB05_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN5 = 0)
#define PB05_DIR_INPUT() (CW_GPIOB->DIR_f.PIN5 = 1)
#define PB06_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN6 = 0)
#define PB06_DIR_INPUT() (CW_GPIOB->DIR_f.PIN6 = 1)
#define PB07_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN7 = 0)
#define PB07_DIR_INPUT() (CW_GPIOB->DIR_f.PIN7 = 1)
#define PB08_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN8 = 0)
#define PB08_DIR_INPUT() (CW_GPIOB->DIR_f.PIN8 = 1)
#define PB09_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN9 = 0)
#define PB09_DIR_INPUT() (CW_GPIOB->DIR_f.PIN9 = 1)
#define PB10_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN10 = 0)
#define PB10_DIR_INPUT() (CW_GPIOB->DIR_f.PIN10 = 1)
#define PB11_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN11 = 0)
#define PB11_DIR_INPUT() (CW_GPIOB->DIR_f.PIN11 = 1)
#define PB12_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN12 = 0)
#define PB12_DIR_INPUT() (CW_GPIOB->DIR_f.PIN12 = 1)
#define PB13_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN13 = 0)
#define PB13_DIR_INPUT() (CW_GPIOB->DIR_f.PIN13 = 1)
#define PB14_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN14 = 0)
#define PB14_DIR_INPUT() (CW_GPIOB->DIR_f.PIN14 = 1)
#define PB15_DIR_OUTPUT() (CW_GPIOB->DIR_f.PIN15 = 0)
#define PB15_DIR_INPUT() (CW_GPIOB->DIR_f.PIN15 = 1)

