VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031_gpio.h
#define PC00_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN0 = 0)
#define PC00_DIR_INPUT() (CW_GPIOC->DIR_f.PIN0 = 1)
#define PC01_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN1 = 0)
#define PC01_DIR_INPUT() (CW_GPIOC->DIR_f.PIN1 = 1)
#define PC02_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN2 = 0)
#define PC02_DIR_INPUT() (CW_GPIOC->DIR_f.PIN2 = 1)
#define PC03_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN3 = 0)
#define PC03_DIR_INPUT() (CW_GPIOC->DIR_f.PIN3 = 1)
#define PC04_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN4 = 0)
#define PC04_DIR_INPUT() (CW_GPIOC->DIR_f.PIN4 = 1)
#define PC05_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN5 = 0)
#define PC05_DIR_INPUT() (CW_GPIOC->DIR_f.PIN5 = 1)
#define PC06_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN6 = 0)
#define PC06_DIR_INPUT() (CW_GPIOC->DIR_f.PIN6 = 1)
#define PC07_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN7 = 0)
#define PC07_DIR_INPUT() (CW_GPIOC->DIR_f.PIN7 = 1)
#define PC08_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN8 = 0)
#define PC08_DIR_INPUT() (CW_GPIOC->DIR_f.PIN8 = 1)
#define PC09_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN9 = 0)
#define PC09_DIR_INPUT() (CW_GPIOC->DIR_f.PIN9 = 1)
#define PC10_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN10 = 0)
#define PC10_DIR_INPUT() (CW_GPIOC->DIR_f.PIN10 = 1)
#define PC11_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN11 = 0)
#define PC11_DIR_INPUT() (CW_GPIOC->DIR_f.PIN11 = 1)
#define PC12_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN12 = 0)
#define PC12_DIR_INPUT() (CW_GPIOC->DIR_f.PIN12 = 1)
#define PC13_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN13 = 0)
#define PC13_DIR_INPUT() (CW_GPIOC->DIR_f.PIN13 = 1)
#define PC14_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN14 = 0)
#define PC14_DIR_INPUT() (CW_GPIOC->DIR_f.PIN14 = 1)
#define PC15_DIR_OUTPUT() (CW_GPIOC->DIR_f.PIN15 = 0)
#define PC15_DIR_INPUT() (CW_GPIOC->DIR_f.PIN15 = 1)

#define PF00_DIR_OUTPUT() (CW_GPIOF->DIR_f.PIN0 = 0)
#define PF00_DIR_INPUT() (CW_GPIOF->DIR_f.PIN0 = 1)
#define PF01_DIR_OUTPUT() (CW_GPIOF->DIR_f.PIN1 = 0)
#define PF01_DIR_INPUT() (CW_GPIOF->DIR_f.PIN1 = 1)
#define PF06_DIR_OUTPUT() (CW_GPIOF->DIR_f.PIN6 = 0)
#define PF06_DIR_INPUT() (CW_GPIOF->DIR_f.PIN6 = 1)
#define PF07_DIR_OUTPUT() (CW_GPIOF->DIR_f.PIN7 = 0)
#define PF07_DIR_INPUT() (CW_GPIOF->DIR_f.PIN7 = 1)

//============================================================
// push-pull or opendrain
#define PA00_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN0 = 0)
#define PA00_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN0 = 1)
#define PA01_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN1 = 0)
#define PA01_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN1 = 1)
#define PA02_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN2 = 0)
#define PA02_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN2 = 1)
#define PA03_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN3 = 0)
#define PA03_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN3 = 1)
#define PA04_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN4 = 0)
#define PA04_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN4 = 1)
#define PA05_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN5 = 0)
#define PA05_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN5 = 1)
#define PA06_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN6 = 0)
#define PA06_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN6 = 1)
#define PA07_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN7 = 0)
#define PA07_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN7 = 1)
#define PA08_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN8 = 0)
#define PA08_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN8 = 1)
#define PA09_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN9 = 0)
#define PA09_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN9 = 1)
#define PA10_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN10 = 0)
#define PA10_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN10 = 1)
#define PA11_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN11 = 0)
#define PA11_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN11 = 1)
#define PA12_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN12 = 0)
#define PA12_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN12 = 1)
#define PA13_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN13 = 0)
#define PA13_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN13 = 1)
#define PA14_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN14 = 0)
#define PA14_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN14 = 1)
#define PA15_PUSHPULL_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN15 = 0)
#define PA15_OPENDRAIN_ENABLE() (CW_GPIOA->OPENDRAIN_f.PIN15 = 1)

#define PB00_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN0 = 0)
#define PB00_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN0 = 1)
#define PB01_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN1 = 0)
#define PB01_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN1 = 1)
#define PB02_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN2 = 0)
#define PB02_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN2 = 1)
#define PB03_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN3 = 0)
#define PB03_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN3 = 1)
#define PB04_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN4 = 0)
#define PB04_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN4 = 1)
#define PB05_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN5 = 0)
#define PB05_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN5 = 1)
#define PB06_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN6 = 0)
#define PB06_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN6 = 1)
#define PB07_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN7 = 0)
#define PB07_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN7 = 1)
#define PB08_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN8 = 0)
#define PB08_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN8 = 1)
#define PB09_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN9 = 0)
#define PB09_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN9 = 1)
#define PB10_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN10 = 0)
#define PB10_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN10 = 1)
#define PB11_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN11 = 0)
#define PB11_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN11 = 1)
#define PB12_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN12 = 0)
#define PB12_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN12 = 1)
#define PB13_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN13 = 0)
#define PB13_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN13 = 1)
#define PB14_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN14 = 0)
#define PB14_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN14 = 1)
#define PB15_PUSHPULL_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN15 = 0)
#define PB15_OPENDRAIN_ENABLE() (CW_GPIOB->OPENDRAIN_f.PIN15 = 1)

