VDowbensky/Panchip/WHXY/SPL/Libraries/inc/cw32w031_gpio.h
#define PC13_AFx_GPIO() (CW_GPIOC->AFRH_f.AFR13 = 0)
#define PC13_AFx_UART1TXD() (CW_GPIOC->AFRH_f.AFR13 = 1)
#define PC13_AFx_RTC1Hz() (CW_GPIOC->AFRH_f.AFR13 = 2)
#define PC13_AFx_UART1CTS() (CW_GPIOC->AFRH_f.AFR13 = 3)
#define PC13_AFx_RTCOUT() (CW_GPIOC->AFRH_f.AFR13 = 4)
#define PC13_AFx_BTIMETR() (CW_GPIOC->AFRH_f.AFR13 = 5)
#define PC13_AFx_RTCTAMP() (CW_GPIOC->AFRH_f.AFR13 = 7)
#define PC14_AFx_GPIO() (CW_GPIOC->AFRH_f.AFR14 = 0)
#define PC14_AFx_AWTETR() (CW_GPIOC->AFRH_f.AFR14 = 1)
#define PC14_AFx_UART2TXD() (CW_GPIOC->AFRH_f.AFR14 = 2)
#define PC14_AFx_UART1RTS() (CW_GPIOC->AFRH_f.AFR14 = 3)
#define PC14_AFx_BTIM2TOGN() (CW_GPIOC->AFRH_f.AFR14 = 4)
#define PC14_AFx_UART2RXD() (CW_GPIOC->AFRH_f.AFR14 = 5)
#define PC15_AFx_GPIO() (CW_GPIOC->AFRH_f.AFR15 = 0)
#define PC15_AFx_HSEOUT() (CW_GPIOC->AFRH_f.AFR15 = 1)
#define PC15_AFx_UART2RXD() (CW_GPIOC->AFRH_f.AFR15 = 2)
#define PC15_AFx_MCOOUT() (CW_GPIOC->AFRH_f.AFR15 = 3)
#define PC15_AFx_BTIM2TOGP() (CW_GPIOC->AFRH_f.AFR15 = 4)
#define PC15_AFx_UART2TXD() (CW_GPIOC->AFRH_f.AFR15 = 5)
#define PC15_AFx_UART1RXD() (CW_GPIOC->AFRH_f.AFR15 = 6)

#define PF00_AFx_GPIO() (CW_GPIOF->AFRL_f.AFR0 = 0)
#define PF00_AFx_AWTETR() (CW_GPIOF->AFRL_f.AFR0 = 1)
#define PF00_AFx_UART3TXD() (CW_GPIOF->AFRL_f.AFR0 = 2)
#define PF00_AFx_I2C1SDA() (CW_GPIOF->AFRL_f.AFR0 = 3)
#define PF00_AFx_BTIM1TOGP() (CW_GPIOF->AFRL_f.AFR0 = 4)
#define PF00_AFx_UART3RXD() (CW_GPIOF->AFRL_f.AFR0 = 5)
#define PF00_AFx_GTIM2TOGN() (CW_GPIOF->AFRL_f.AFR0 = 6)
#define PF01_AFx_GPIO() (CW_GPIOF->AFRL_f.AFR1 = 0)
#define PF01_AFx_LSEOUT() (CW_GPIOF->AFRL_f.AFR1 = 1)
#define PF01_AFx_UART3RXD() (CW_GPIOF->AFRL_f.AFR1 = 2)
#define PF01_AFx_I2C1SCL() (CW_GPIOF->AFRL_f.AFR1 = 3)
#define PF01_AFx_BTIM1TOGN() (CW_GPIOF->AFRL_f.AFR1 = 4)
#define PF01_AFx_UART3TXD() (CW_GPIOF->AFRL_f.AFR1 = 5)
#define PF01_AFx_GTIM2TOGP() (CW_GPIOF->AFRL_f.AFR1 = 6)
#define PF06_AFx_GPIO() (CW_GPIOF->AFRL_f.AFR6 = 0)
#define PF06_AFx_UART3CTS() (CW_GPIOF->AFRL_f.AFR6 = 1)
#define PF06_AFx_I2C1SCL() (CW_GPIOF->AFRL_f.AFR6 = 2)
#define PF06_AFx_UART2CTS() (CW_GPIOF->AFRL_f.AFR6 = 4)
#define PF06_AFx_BTIM3TOGP() (CW_GPIOF->AFRL_f.AFR6 = 7)
#define PF07_AFx_GPIO() (CW_GPIOF->AFRL_f.AFR7 = 0)
#define PF07_AFx_UART3RTS() (CW_GPIOF->AFRL_f.AFR7 = 1)
#define PF07_AFx_I2C1SDA() (CW_GPIOF->AFRL_f.AFR7 = 2)
#define PF07_AFx_UART2RTS() (CW_GPIOF->AFRL_f.AFR7 = 4)
#define PF07_AFx_BTIM3TOGN() (CW_GPIOF->AFRL_f.AFR7 = 7)

    //============================================================

#ifdef __cplusplus
}
#endif

#endif
